; domain
(define (domain manipulation_domain)
	(:requirements :strips :typing :fluents :negative-preconditions)
	(:types
		location - object
		locatable - object
		item - locatable
		robot  - locatable
		container - item
		food - item
	)

	(:predicates
		(in ?arg0 - item ?arg1 - robot)
		(at ?arg0 - locatable ?arg1 - location)
		(on ?arg0 - item ?arg1 - item)
	)

	
	;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; ACTIONS ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action go
		:parameters (?r - robot ?l1 - location ?l2 - location)
		:precondition 
			(and
				(at ?r ?l1)
			)
		:effect
			(and
				(not (at ?r ?l1))
				(at ?r ?l2)
			)
	)


	(:action place
		:parameters (?r - robot ?o - item ?l - location )
		:precondition 
			(and
				(at ?r ?l)
				(in ?o ?r)
			)
		:effect
			(and
				(not (in ?o ?r))
				(at ?o ?l)
			)
	)

	(:action put_on_container
		:parameters (?r - robot ?o1 - item ?c - container ?l - location)
		:precondition 
			(and
				(at ?r ?l)
				(in ?o1 ?r)
				(at ?c ?l)
			)
		:effect
			(and
				(not (in ?o1 ?r))
				(at ?o1 ?l)
				(on ?o1 ?c)
			)
	)


	(:action pick
		:parameters (?r - robot ?o - item ?l - location )
		:precondition 
			(and
				(at ?r ?l)
				(at ?o ?l)
				(forall (?o2 - item)
						(not (on ?o2 ?o))
				)
			)
		:effect
			(and
				(in ?o ?r)
				(not (at ?o ?l))
			)
	)

	(:action unstack
		:parameters (?r - robot ?o1 - item ?o2 - item ?l - location )
		:precondition 
			(and
				(at ?r ?l)
				(at ?o2 ?l)
				(at ?o1 ?l)
				(forall (?o3 - item)
					(not (on ?o3 ?o1))
				)
				(on ?o1 ?o2)
			)
		:effect
			(and
				(not (on ?o1 ?o2))
				(in ?o1 ?r)
				(not (at ?o1 ?l))
			)
	)


)

; problem
(define (problem pfile01)
	(:domain  manipulation_domain)
	(:objects
        fork knife - item
        wp1s wp2s - location
        wp1f wp2f  - location
        home1 - location 
	robot1  - robot
    	)
    	(:init
		(at robot1 home1)
		(at fork wp1s)
		(at knife wp2s)
	)
    	(:goal
		(and
		    (at fork wp1f)
		    (at knife wp2f)
		)
    	)

	
)

; plan
1. (go robot1 home1 wp1s)
   deleted: (at robot1 home1)
   added: (at robot1 wp1s)
   goals met: 0 of 2
2. (pick robot1 fork wp1s)
   deleted: (at fork wp1s)
   added: (in fork robot1)
   goals met: 0 of 2
3. (go robot1 wp1s wp1f)
   deleted: (at robot1 wp1s)
   added: (at robot1 wp1f)
   goals met: 0 of 2
4. (place robot1 fork wp1f)
   deleted: (in fork robot1)
   added: (at fork wp1f)
   goals met: 1 of 2
5. (go robot1 wp1f wp2s)
   deleted: (at robot1 wp1f)
   added: (at robot1 wp2s)
   goals met: 1 of 2
6. (pick robot1 knife wp2s)
   deleted: (at knife wp2s)
   added: (in knife robot1)
   goals met: 1 of 2
7. (go robot1 wp2s wp2f)
   deleted: (at robot1 wp2s)
   added: (at robot1 wp2f)
   goals met: 1 of 2
8. (place robot1 knife wp2f)
   deleted: (in knife robot1)
   added: (at knife wp2f)
   goals met: 2 of 2
